# Используйте официальный образ Python
FROM python:3.8

# Установите переменную среды для запуска в непроизводственном режиме
ENV ENVIRONMENT=production

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем зависимости проекта (файлы requirements.txt)
COPY requirements.txt .

# Устанавливаем зависимости
RUN pip install --no-cache-dir -r requirements.txt

# Копируем остальные файлы проекта в текущую директорию контейнера
COPY . .

# Открываем порт, на котором будет работать приложение
EXPOSE 8000

# Команда для запуска приложения
CMD ["uvicorn", "main:app", "--host", "0.0.0.0", "--port", "8000"]